КУРСОВАЯ ПО JAVA
«Курсовая работа. программирование (java, android studio)»
ЗАДАНИЕ:
Тема - Создание мобильного приложения для транспортной компании
Кол-во страниц: от 50 до 70
Уникальность: 60% по antiplagiat.ru
java, android studio
Мобильное приложения должно решать такие задачи как:
1) Расчет стоимости грузоперевозки с учетом веса, объема индивидуальных особенностей груза, а так же маршрута грузоперевозки;
2) Построение маршрута;
3) Отслеживание груза по карте в реальном времени;
4) Ведение журнала заказов
5) Связь с водителем;
6) Заказ грузоперевозки;
7)Заказ услуг грузчиков.
Сервер писать не нужно, можно отправлять любые данные для примера

----

Добрый день!

Нужна курсовая работа: написать приложение на Java, реализацию алгоритма для игры.

Оплата - в течение 3-5 дней после получения готовой работы.

Пожалуйста, указывайте цену, срок и опыт написания по данной теме работ на заказ (если данной информации нет в Вашем аккаунте).

С уважением,
Алексей.

----

Среда программирования: Java NetBeans

База данных: Текстовый файл (свой формат)

Название работы: Авиазавод (Java)

Вид работы: Курсовая работа

Тематика работы: Базы данных

Объем программы: 3 (по десятибалльной шкале)

Уровень сложности: 3 (по десятибалльной шкале)

Разработчик (автор): Программист сайта kursovik.com (письмо автору)

Ключевые слова: Авиазавод, самолеты, контейнер, объекты, связная реализация, адресные связи, двигатель, планер, стоимость, суммарная стоимость

Функции программы:

Разработать объектную программу в Java (NetBeans) на тему "Авиазавод".

Получение навыков разработки объектных программ, включая создание набора собственных взаимосвязанных классов для объектной реализации специализированного контейнера. Контейнер предназначен для хранения и обработки данных конкретной информационной задачи. Контейнер представляет собой одно- или двухуровневую структуру данных, которая реализуется разными способами – либо на основе массива (непрерывная реализация), либо на основе адресных связей (связная реализация).

Информационная задача:
Объект "Самолет" (с полем данных "Заводской номер") включает в себя объекты "Двигатель" и "Планер" с полями данных "Стоимость". Самолеты собираются в контейнер "Авиазавод" с возможностью подсчета суммарной стоимости всех самолетов.

Структурная основа контейнера:
Двунаправленный разомкнутый список без заголовка с операциями добавления нового элемента ПОСЛЕ заданного, удаления и поиска

Требования:
1. Полная объектная реализация с определением классов для всех элементов реализуемой структуры: информационные объекты (обязательно!), объекты-списки, объект-контейнер.
2. Имена классов, свойств и методов должны носить содержательный смысл и соответствовать информационной задаче.
3. Соблюдение принципа инкапсуляции – использование в классах только закрытых свойств и реализация необходимого набора методов доступа.
4. Реализация в классах всех необходимых методов: конструкторы, методы доступа к свойствам, методы добавления и удаления на каждом из уровней, метод поиска (при необходимости).
5. Возможность сохранения всей структуры во внешнем файле с обратной загрузкой.
6. Наличие модуля, демонстрирующего все возможности созданной библиотеки классов и обладающего удобным оконным пользовательским интерфейсом.
 